test/fio-outputs/baseline.txt
seq-read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
rand-read: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
seq-write: (g=2): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
rand-write: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
fio-3.20-90-g5bd52
Starting 4 threads
xnvme_fioe: init(): td->io_ops: 0x7f5d9ad99320
xnvme_fioe: init(): td->io_ops: 0x7f5d9ad99320
xnvme_fioe: init(): td->io_ops: 0x7f5d9ad99320
[...]

seq-read: (groupid=0, jobs=1): err= 0: pid=19467: Sat Sep 26 11:57:30 2020
  read: IOPS=89.0k, BW=348MiB/s (365MB/s)(61.1GiB/180000msec)
    slat (nsec): min=2557, max=1252.8k, avg=2680.45, stdev=535.58
    clat (nsec): min=202, max=2152.7k, avg=8015.92, stdev=1470.15
     lat (usec): min=9, max=2155, avg=10.70, stdev= 1.56
    clat percentiles (nsec):
     |  1.00th=[ 7008],  5.00th=[ 7136], 10.00th=[ 7264], 20.00th=[ 7328],
     | 30.00th=[ 7456], 40.00th=[ 7584], 50.00th=[ 7712], 60.00th=[ 7968],
     | 70.00th=[ 8384], 80.00th=[ 9024], 90.00th=[ 9152], 95.00th=[ 9280],
     | 99.00th=[ 9664], 99.50th=[10048], 99.90th=[11072], 99.95th=[11840],
     | 99.99th=[12480]
   bw (  KiB/s): min= 1902, max=20277227, per=100.00%, avg=515690.42, stdev=54294.26, samples=16025040
   iops        : min=88667, max=89372, avg=89124.03, stdev=121.19, samples=260
  lat (nsec)   : 250=0.01%, 500=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=99.50%, 20=0.50%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=80.55%, sys=19.45%, ctx=716, majf=0, minf=501129
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16025040,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-read: (groupid=1, jobs=1): err= 0: pid=19487: Sat Sep 26 11:57:30 2020
  read: IOPS=17.0k, BW=66.5MiB/s (69.7MB/s)(11.7GiB/180001msec)
    slat (nsec): min=2575, max=322222, avg=2690.35, stdev=242.44
    clat (usec): min=3, max=2560, avg=55.37, stdev=10.30
     lat (usec): min=44, max=2590, avg=58.06, stdev=10.30
    clat percentiles (nsec):
     |  1.00th=[42752],  5.00th=[43776], 10.00th=[44800], 20.00th=[45824],
     | 30.00th=[47360], 40.00th=[48896], 50.00th=[58112], 60.00th=[61696],
     | 70.00th=[63232], 80.00th=[64768], 90.00th=[66048], 95.00th=[66048],
     | 99.00th=[67072], 99.50th=[67072], 99.90th=[69120], 99.95th=[71168],
     | 99.99th=[99840]
   bw (  KiB/s): min= 1599, max=1028112, per=100.00%, avg=75929.81, stdev=12226.48, samples=3062062
   iops        : min=16826, max=17106, avg=17029.57, stdev=46.52, samples=259
  lat (usec)   : 4=0.01%, 50=47.33%, 100=52.66%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=96.26%, sys=3.74%, ctx=436, majf=0, minf=165653
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3062062,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
seq-write: (groupid=2, jobs=1): err= 0: pid=19521: Sat Sep 26 11:57:30 2020
  write: IOPS=59.2k, BW=231MiB/s (243MB/s)(40.7GiB/180001msec); 0 zone resets
    slat (nsec): min=2617, max=1686.0k, avg=2766.38, stdev=765.71
    clat (nsec): min=172, max=8998.8k, avg=13570.11, stdev=60098.05
     lat (usec): min=9, max=9001, avg=16.34, stdev=60.10
    clat percentiles (usec):
     |  1.00th=[    7],  5.00th=[    7], 10.00th=[    8], 20.00th=[    8],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    8],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   11], 95.00th=[   11],
     | 99.00th=[  101], 99.50th=[  273], 99.90th=[  979], 99.95th=[ 1106],
     | 99.99th=[ 1336]
   bw (  KiB/s): min=  455, max=23813953, per=100.00%, avg=491987.49, stdev=110319.06, samples=10662631
   iops        : min=36986, max=87120, avg=59350.34, stdev=21004.36, samples=261
  lat (nsec)   : 250=0.01%, 500=0.01%
  lat (usec)   : 4=0.01%, 10=78.87%, 20=18.03%, 50=1.25%, 100=0.83%
  lat (usec)   : 250=0.49%, 500=0.14%, 750=0.15%, 1000=0.15%
  lat (msec)   : 2=0.09%, 4=0.01%, 10=0.01%
  cpu          : usr=86.61%, sys=13.38%, ctx=545, majf=0, minf=333275
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10662631,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-write: (groupid=3, jobs=1): err= 0: pid=19548: Sat Sep 26 11:57:30 2020
  write: IOPS=37.0k, BW=148MiB/s (156MB/s)(26.1GiB/180001msec); 0 zone resets
    slat (usec): min=2, max=1927, avg= 2.82, stdev= 2.15
    clat (nsec): min=179, max=7131.6k, avg=22767.16, stdev=102768.10
     lat (usec): min=9, max=7134, avg=25.59, stdev=102.78
    clat percentiles (usec):
     |  1.00th=[    7],  5.00th=[    7], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    7], 40.00th=[    8], 50.00th=[    8], 60.00th=[    8],
     | 70.00th=[    8], 80.00th=[    8], 90.00th=[    8], 95.00th=[   51],
     | 99.00th=[  570], 99.50th=[  906], 99.90th=[ 1237], 99.95th=[ 1352],
     | 99.99th=[ 1582]
   bw (  KiB/s): min=  574, max=22882681, per=100.00%, avg=540704.66, stdev=147920.76, samples=6838785
   iops        : min=36441, max=40090, avg=38032.73, stdev=597.36, samples=264
  lat (nsec)   : 250=0.01%, 500=0.01%
  lat (usec)   : 2=0.01%, 4=0.02%, 10=91.38%, 20=1.19%, 50=2.35%
  lat (usec)   : 100=1.92%, 250=1.54%, 500=0.48%, 750=0.38%, 1000=0.37%
  lat (msec)   : 2=0.36%, 4=0.01%, 10=0.01%
  cpu          : usr=91.20%, sys=8.79%, ctx=507, majf=0, minf=283890
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6838785,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=348MiB/s (365MB/s), 348MiB/s-348MiB/s (365MB/s-365MB/s), io=61.1GiB (65.6GB), run=180000-180000msec

Run status group 1 (all jobs):
   READ: bw=66.5MiB/s (69.7MB/s), 66.5MiB/s-66.5MiB/s (69.7MB/s-69.7MB/s), io=11.7GiB (12.5GB), run=180001-180001msec

Run status group 2 (all jobs):
  WRITE: bw=231MiB/s (243MB/s), 231MiB/s-231MiB/s (243MB/s-243MB/s), io=40.7GiB (43.7GB), run=180001-180001msec

Run status group 3 (all jobs):
  WRITE: bw=148MiB/s (156MB/s), 148MiB/s-148MiB/s (156MB/s-156MB/s), io=26.1GiB (28.0GB), run=180001-180001msec