test/fio-outputs/bs128k-read.txt
warmup: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=xnvme, iodepth=1
bs128k-read: (g=1): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=xnvme, iodepth=1
fio-3.20-90-g5bd52
Starting 2 threads
xnvme_fioe: init(): td->io_ops: 0x7f74901a0320
xnvme_fioe: init(): td->io_ops: 0x7f74901a0320

warmup: (groupid=0, jobs=1): err= 0: pid=17708: Sun Feb 28 16:46:43 2021
  read: IOPS=10.0k, BW=1372MiB/s (1438MB/s)(1220GiB/910856msec)
    clat (usec): min=5, max=679, avg=83.40, stdev=38.18
     lat (usec): min=51, max=686, avg=90.79, stdev=38.18
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   46], 10.00th=[   46], 20.00th=[   46],
     | 30.00th=[   52], 40.00th=[   64], 50.00th=[   75], 60.00th=[   87],
     | 70.00th=[   99], 80.00th=[  116], 90.00th=[  139], 95.00th=[  159],
     | 99.00th=[  198], 99.50th=[  212], 99.90th=[  243], 99.95th=[  255],
     | 99.99th=[  281]
   bw (  MiB/s): min= 1360, max= 1383, per=100.00%, avg=1373.27, stdev= 3.44, samples=1312
   iops        : min=10882, max=11070, avg=10985.77, stdev=27.63, samples=1312
  lat (usec)   : 10=0.01%, 20=0.01%, 50=28.30%, 100=42.36%, 250=29.27%
  lat (usec)   : 500=0.07%, 750=0.01%
  cpu          : usr=92.70%, sys=7.30%, ctx=2139, majf=0, minf=3472
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=9995763,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
  steadystate  : attained=yes, bw=1372MiB/s (1405MB/s), iops=10.0k, iops slope=0.000%
bs128k-read: (groupid=1, jobs=1): err= 0: pid=18153: Sun Feb 28 16:46:43 2021
  read: IOPS=10.0k, BW=1372MiB/s (1438MB/s)(1206GiB/900001msec)
    clat (usec): min=2, max=648, avg=83.20, stdev=38.09
     lat (usec): min=51, max=655, avg=90.66, stdev=38.09
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   46], 10.00th=[   46], 20.00th=[   46],
     | 30.00th=[   52], 40.00th=[   64], 50.00th=[   75], 60.00th=[   86],
     | 70.00th=[   99], 80.00th=[  115], 90.00th=[  137], 95.00th=[  157],
     | 99.00th=[  198], 99.50th=[  212], 99.90th=[  243], 99.95th=[  255],
     | 99.99th=[  281]
   bw (  MiB/s): min= 1358, max= 1386, per=100.00%, avg=1373.29, stdev= 4.02, samples=1797
   iops        : min=10864, max=11094, avg=10986.36, stdev=32.19, samples=1797
  lat (usec)   : 4=0.01%, 10=0.01%, 50=28.57%, 100=42.31%, 250=29.06%
  lat (usec)   : 500=0.06%, 750=0.01%
  cpu          : usr=92.54%, sys=7.46%, ctx=2898, majf=0, minf=157595
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=9876445,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1372MiB/s (1438MB/s), 1372MiB/s-1372MiB/s (1438MB/s-1438MB/s), io=1220GiB (1310GB), run=910856-910856msec

Run status group 1 (all jobs):
   READ: bw=1372MiB/s (1438MB/s), 1372MiB/s-1372MiB/s (1438MB/s-1438MB/s), io=1206GiB (1295GB), run=900001-900001msec